```
-/+ resource "google_container_node_pool" "pools" {
      ~ id                          = "projects/<redacted>/locations/us-west1/clusters/perf/nodePools/standard" -> (known after apply)
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/<redacted>/zones/us-west1-a/instanceGroupManagers/gke-perf-standard-93a7d26d-grp",
          - "https://www.googleapis.com/compute/v1/projects/<redacted>/zones/us-west1-b/instanceGroupManagers/gke-perf-standard-39917066-grp",
          - "https://www.googleapis.com/compute/v1/projects/<redacted>/zones/us-west1-c/instanceGroupManagers/gke-perf-standard-68fb7977-grp",
        ] -> (known after apply)
      ~ managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/beta/projects/<redacted>/zones/us-west1-a/instanceGroups/gke-perf-standard-93a7d26d-grp",
          - "https://www.googleapis.com/compute/beta/projects/<redacted>/zones/us-west1-b/instanceGroups/gke-perf-standard-39917066-grp",
          - "https://www.googleapis.com/compute/beta/projects/<redacted>/zones/us-west1-c/instanceGroups/gke-perf-standard-68fb7977-grp",
        ] -> (known after apply)
        name                        = "standard"
      + name_prefix                 = (known after apply)
      ~ node_count                  = 0 -> (known after apply)
      ~ node_locations              = [
          - "us-west1-a",
          - "us-west1-b",
          - "us-west1-c",
        ] -> (known after apply)
      + operation                   = (known after apply)
      ~ version                     = "1.21.10-gke.2000" -> (known after apply)
        # (5 unchanged attributes hidden)



      ~ network_config {
          ~ create_pod_range    = false -> (known after apply)
          ~ pod_ipv4_cidr_block = "192.168.0.0/18" -> (known after apply)
          ~ pod_range           = "ip-range-pods" -> (known after apply)
        }

      ~ node_config {
          ~ service_account   = "default" -> (known after apply)
            tags              = [
                "gke-perf",
                "gke-perf-standard",
            ]
          ~ taint             = [] -> (known after apply)
            # (11 unchanged attributes hidden)

          + gcfs_config { # forces replacement
              + enabled = false # forces replacement
            }


            # (2 unchanged blocks hidden)
        }


        # (4 unchanged blocks hidden)
    }
```